Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.0.38/samv70b/include/component/dacc.h
#define DACC_TRIGR_TRGEN_Pos                  _U_(0)                                               /**< (DACC_TRIGR Position) Trigger Enable of Channel x */
#define DACC_TRIGR_TRGEN_Msk                  (_U_(0x3) << DACC_TRIGR_TRGEN_Pos)                   /**< (DACC_TRIGR Mask) TRGEN */
#define DACC_TRIGR_TRGEN(value)               (DACC_TRIGR_TRGEN_Msk & ((value) << DACC_TRIGR_TRGEN_Pos)) 

/* -------- DACC_CHER : (DACC Offset: 0x10) ( /W 32) Channel Enable Register -------- */
#define DACC_CHER_CH0_Pos                     _U_(0)                                               /**< (DACC_CHER) Channel 0 Enable Position */
#define DACC_CHER_CH0_Msk                     (_U_(0x1) << DACC_CHER_CH0_Pos)                      /**< (DACC_CHER) Channel 0 Enable Mask */
#define DACC_CHER_CH0(value)                  (DACC_CHER_CH0_Msk & ((value) << DACC_CHER_CH0_Pos))
#define DACC_CHER_CH1_Pos                     _U_(1)                                               /**< (DACC_CHER) Channel 1 Enable Position */
#define DACC_CHER_CH1_Msk                     (_U_(0x1) << DACC_CHER_CH1_Pos)                      /**< (DACC_CHER) Channel 1 Enable Mask */
#define DACC_CHER_CH1(value)                  (DACC_CHER_CH1_Msk & ((value) << DACC_CHER_CH1_Pos))
#define DACC_CHER_Msk                         _U_(0x00000003)                                      /**< (DACC_CHER) Register Mask  */

#define DACC_CHER_CH_Pos                      _U_(0)                                               /**< (DACC_CHER Position) Channel x Enable */
#define DACC_CHER_CH_Msk                      (_U_(0x3) << DACC_CHER_CH_Pos)                       /**< (DACC_CHER Mask) CH */
#define DACC_CHER_CH(value)                   (DACC_CHER_CH_Msk & ((value) << DACC_CHER_CH_Pos))   

/* -------- DACC_CHDR : (DACC Offset: 0x14) ( /W 32) Channel Disable Register -------- */
#define DACC_CHDR_CH0_Pos                     _U_(0)                                               /**< (DACC_CHDR) Channel 0 Disable Position */
#define DACC_CHDR_CH0_Msk                     (_U_(0x1) << DACC_CHDR_CH0_Pos)                      /**< (DACC_CHDR) Channel 0 Disable Mask */
#define DACC_CHDR_CH0(value)                  (DACC_CHDR_CH0_Msk & ((value) << DACC_CHDR_CH0_Pos))
#define DACC_CHDR_CH1_Pos                     _U_(1)                                               /**< (DACC_CHDR) Channel 1 Disable Position */
#define DACC_CHDR_CH1_Msk                     (_U_(0x1) << DACC_CHDR_CH1_Pos)                      /**< (DACC_CHDR) Channel 1 Disable Mask */
#define DACC_CHDR_CH1(value)                  (DACC_CHDR_CH1_Msk & ((value) << DACC_CHDR_CH1_Pos))
#define DACC_CHDR_Msk                         _U_(0x00000003)                                      /**< (DACC_CHDR) Register Mask  */

#define DACC_CHDR_CH_Pos                      _U_(0)                                               /**< (DACC_CHDR Position) Channel x Disable */
#define DACC_CHDR_CH_Msk                      (_U_(0x3) << DACC_CHDR_CH_Pos)                       /**< (DACC_CHDR Mask) CH */
#define DACC_CHDR_CH(value)                   (DACC_CHDR_CH_Msk & ((value) << DACC_CHDR_CH_Pos))   

/* -------- DACC_CHSR : (DACC Offset: 0x18) ( R/ 32) Channel Status Register -------- */
#define DACC_CHSR_CH0_Pos                     _U_(0)                                               /**< (DACC_CHSR) Channel 0 Status Position */
#define DACC_CHSR_CH0_Msk                     (_U_(0x1) << DACC_CHSR_CH0_Pos)                      /**< (DACC_CHSR) Channel 0 Status Mask */
#define DACC_CHSR_CH0(value)                  (DACC_CHSR_CH0_Msk & ((value) << DACC_CHSR_CH0_Pos))
#define DACC_CHSR_CH1_Pos                     _U_(1)                                               /**< (DACC_CHSR) Channel 1 Status Position */
#define DACC_CHSR_CH1_Msk                     (_U_(0x1) << DACC_CHSR_CH1_Pos)                      /**< (DACC_CHSR) Channel 1 Status Mask */
#define DACC_CHSR_CH1(value)                  (DACC_CHSR_CH1_Msk & ((value) << DACC_CHSR_CH1_Pos))
#define DACC_CHSR_DACRDY0_Pos                 _U_(8)                                               /**< (DACC_CHSR) DAC Ready Flag Position */
#define DACC_CHSR_DACRDY0_Msk                 (_U_(0x1) << DACC_CHSR_DACRDY0_Pos)                  /**< (DACC_CHSR) DAC Ready Flag Mask */
#define DACC_CHSR_DACRDY0(value)              (DACC_CHSR_DACRDY0_Msk & ((value) << DACC_CHSR_DACRDY0_Pos))
#define DACC_CHSR_DACRDY1_Pos                 _U_(9)                                               /**< (DACC_CHSR) DAC Ready Flag Position */
#define DACC_CHSR_DACRDY1_Msk                 (_U_(0x1) << DACC_CHSR_DACRDY1_Pos)                  /**< (DACC_CHSR) DAC Ready Flag Mask */
#define DACC_CHSR_DACRDY1(value)              (DACC_CHSR_DACRDY1_Msk & ((value) << DACC_CHSR_DACRDY1_Pos))
#define DACC_CHSR_Msk                         _U_(0x00000303)                                      /**< (DACC_CHSR) Register Mask  */

#define DACC_CHSR_CH_Pos                      _U_(0)                                               /**< (DACC_CHSR Position) Channel x Status */
#define DACC_CHSR_CH_Msk                      (_U_(0x3) << DACC_CHSR_CH_Pos)                       /**< (DACC_CHSR Mask) CH */
#define DACC_CHSR_CH(value)                   (DACC_CHSR_CH_Msk & ((value) << DACC_CHSR_CH_Pos))   
#define DACC_CHSR_DACRDY_Pos                  _U_(8)                                               /**< (DACC_CHSR Position) DAC Ready Flag */
#define DACC_CHSR_DACRDY_Msk                  (_U_(0x3) << DACC_CHSR_DACRDY_Pos)                   /**< (DACC_CHSR Mask) DACRDY */
#define DACC_CHSR_DACRDY(value)               (DACC_CHSR_DACRDY_Msk & ((value) << DACC_CHSR_DACRDY_Pos)) 

/* -------- DACC_CDR : (DACC Offset: 0x1C) ( /W 32) Conversion Data Register 0 -------- */
#define DACC_CDR_DATA0_Pos                    _U_(0)                                               /**< (DACC_CDR) Data to Convert for channel 0 Position */
#define DACC_CDR_DATA0_Msk                    (_U_(0xFFFF) << DACC_CDR_DATA0_Pos)                  /**< (DACC_CDR) Data to Convert for channel 0 Mask */
#define DACC_CDR_DATA0(value)                 (DACC_CDR_DATA0_Msk & ((value) << DACC_CDR_DATA0_Pos))
#define DACC_CDR_DATA1_Pos                    _U_(16)                                              /**< (DACC_CDR) Data to Convert for channel 1 Position */
#define DACC_CDR_DATA1_Msk                    (_U_(0xFFFF) << DACC_CDR_DATA1_Pos)                  /**< (DACC_CDR) Data to Convert for channel 1 Mask */
#define DACC_CDR_DATA1(value)                 (DACC_CDR_DATA1_Msk & ((value) << DACC_CDR_DATA1_Pos))
#define DACC_CDR_Msk                          _U_(0xFFFFFFFF)                                      /**< (DACC_CDR) Register Mask  */


/* -------- DACC_IER : (DACC Offset: 0x24) ( /W 32) Interrupt Enable Register -------- */
#define DACC_IER_TXRDY0_Pos                   _U_(0)                                               /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 0 Position */
#define DACC_IER_TXRDY0_Msk                   (_U_(0x1) << DACC_IER_TXRDY0_Pos)                    /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 0 Mask */
#define DACC_IER_TXRDY0(value)                (DACC_IER_TXRDY0_Msk & ((value) << DACC_IER_TXRDY0_Pos))
#define DACC_IER_TXRDY1_Pos                   _U_(1)                                               /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 1 Position */
#define DACC_IER_TXRDY1_Msk                   (_U_(0x1) << DACC_IER_TXRDY1_Pos)                    /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 1 Mask */
#define DACC_IER_TXRDY1(value)                (DACC_IER_TXRDY1_Msk & ((value) << DACC_IER_TXRDY1_Pos))
#define DACC_IER_EOC0_Pos                     _U_(4)                                               /**< (DACC_IER) End of Conversion Interrupt Enable of channel 0 Position */
#define DACC_IER_EOC0_Msk                     (_U_(0x1) << DACC_IER_EOC0_Pos)                      /**< (DACC_IER) End of Conversion Interrupt Enable of channel 0 Mask */
#define DACC_IER_EOC0(value)                  (DACC_IER_EOC0_Msk & ((value) << DACC_IER_EOC0_Pos))
#define DACC_IER_EOC1_Pos                     _U_(5)                                               /**< (DACC_IER) End of Conversion Interrupt Enable of channel 1 Position */
#define DACC_IER_EOC1_Msk                     (_U_(0x1) << DACC_IER_EOC1_Pos)                      /**< (DACC_IER) End of Conversion Interrupt Enable of channel 1 Mask */
#define DACC_IER_EOC1(value)                  (DACC_IER_EOC1_Msk & ((value) << DACC_IER_EOC1_Pos))
#define DACC_IER_Msk                          _U_(0x00000033)                                      /**< (DACC_IER) Register Mask  */

