Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.0.38/samv70b/include/component/dacc.h
/* -------- DACC_ISR : (DACC Offset: 0x30) ( R/ 32) Interrupt Status Register -------- */
#define DACC_ISR_TXRDY0_Pos                   _U_(0)                                               /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 0 Position */
#define DACC_ISR_TXRDY0_Msk                   (_U_(0x1) << DACC_ISR_TXRDY0_Pos)                    /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 0 Mask */
#define DACC_ISR_TXRDY0(value)                (DACC_ISR_TXRDY0_Msk & ((value) << DACC_ISR_TXRDY0_Pos))
#define DACC_ISR_TXRDY1_Pos                   _U_(1)                                               /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 1 Position */
#define DACC_ISR_TXRDY1_Msk                   (_U_(0x1) << DACC_ISR_TXRDY1_Pos)                    /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 1 Mask */
#define DACC_ISR_TXRDY1(value)                (DACC_ISR_TXRDY1_Msk & ((value) << DACC_ISR_TXRDY1_Pos))
#define DACC_ISR_EOC0_Pos                     _U_(4)                                               /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 0 Position */
#define DACC_ISR_EOC0_Msk                     (_U_(0x1) << DACC_ISR_EOC0_Pos)                      /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 0 Mask */
#define DACC_ISR_EOC0(value)                  (DACC_ISR_EOC0_Msk & ((value) << DACC_ISR_EOC0_Pos))
#define DACC_ISR_EOC1_Pos                     _U_(5)                                               /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 1 Position */
#define DACC_ISR_EOC1_Msk                     (_U_(0x1) << DACC_ISR_EOC1_Pos)                      /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 1 Mask */
#define DACC_ISR_EOC1(value)                  (DACC_ISR_EOC1_Msk & ((value) << DACC_ISR_EOC1_Pos))
#define DACC_ISR_Msk                          _U_(0x00000033)                                      /**< (DACC_ISR) Register Mask  */

#define DACC_ISR_TXRDY_Pos                    _U_(0)                                               /**< (DACC_ISR Position) Transmit Ready Interrupt Flag of channel x */
#define DACC_ISR_TXRDY_Msk                    (_U_(0x3) << DACC_ISR_TXRDY_Pos)                     /**< (DACC_ISR Mask) TXRDY */
#define DACC_ISR_TXRDY(value)                 (DACC_ISR_TXRDY_Msk & ((value) << DACC_ISR_TXRDY_Pos)) 
#define DACC_ISR_EOC_Pos                      _U_(4)                                               /**< (DACC_ISR Position) End of Conversion Interrupt Flag of channel x */
#define DACC_ISR_EOC_Msk                      (_U_(0x3) << DACC_ISR_EOC_Pos)                       /**< (DACC_ISR Mask) EOC */
#define DACC_ISR_EOC(value)                   (DACC_ISR_EOC_Msk & ((value) << DACC_ISR_EOC_Pos))   

/* -------- DACC_ACR : (DACC Offset: 0x94) (R/W 32) Analog Current Register -------- */
#define DACC_ACR_IBCTLCH0_Pos                 _U_(0)                                               /**< (DACC_ACR) Analog Output Current Control Position */
#define DACC_ACR_IBCTLCH0_Msk                 (_U_(0x3) << DACC_ACR_IBCTLCH0_Pos)                  /**< (DACC_ACR) Analog Output Current Control Mask */
#define DACC_ACR_IBCTLCH0(value)              (DACC_ACR_IBCTLCH0_Msk & ((value) << DACC_ACR_IBCTLCH0_Pos))
#define DACC_ACR_IBCTLCH1_Pos                 _U_(2)                                               /**< (DACC_ACR) Analog Output Current Control Position */
#define DACC_ACR_IBCTLCH1_Msk                 (_U_(0x3) << DACC_ACR_IBCTLCH1_Pos)                  /**< (DACC_ACR) Analog Output Current Control Mask */
#define DACC_ACR_IBCTLCH1(value)              (DACC_ACR_IBCTLCH1_Msk & ((value) << DACC_ACR_IBCTLCH1_Pos))
#define DACC_ACR_Msk                          _U_(0x0000000F)                                      /**< (DACC_ACR) Register Mask  */


/* -------- DACC_WPMR : (DACC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define DACC_WPMR_WPEN_Pos                    _U_(0)                                               /**< (DACC_WPMR) Write Protection Enable Position */
#define DACC_WPMR_WPEN_Msk                    (_U_(0x1) << DACC_WPMR_WPEN_Pos)                     /**< (DACC_WPMR) Write Protection Enable Mask */
#define DACC_WPMR_WPEN(value)                 (DACC_WPMR_WPEN_Msk & ((value) << DACC_WPMR_WPEN_Pos))
#define DACC_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (DACC_WPMR) Write Protect Key Position */
#define DACC_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << DACC_WPMR_WPKEY_Pos)               /**< (DACC_WPMR) Write Protect Key Mask */
#define DACC_WPMR_WPKEY(value)                (DACC_WPMR_WPKEY_Msk & ((value) << DACC_WPMR_WPKEY_Pos))
#define   DACC_WPMR_WPKEY_PASSWD_Val          _U_(0x444143)                                        /**< (DACC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0.  */
#define DACC_WPMR_WPKEY_PASSWD                (DACC_WPMR_WPKEY_PASSWD_Val << DACC_WPMR_WPKEY_Pos)  /**< (DACC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0. Position  */
#define DACC_WPMR_Msk                         _U_(0xFFFFFF01)                                      /**< (DACC_WPMR) Register Mask  */


/* -------- DACC_WPSR : (DACC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define DACC_WPSR_WPVS_Pos                    _U_(0)                                               /**< (DACC_WPSR) Write Protection Violation Status Position */
#define DACC_WPSR_WPVS_Msk                    (_U_(0x1) << DACC_WPSR_WPVS_Pos)                     /**< (DACC_WPSR) Write Protection Violation Status Mask */
#define DACC_WPSR_WPVS(value)                 (DACC_WPSR_WPVS_Msk & ((value) << DACC_WPSR_WPVS_Pos))
#define DACC_WPSR_WPVSRC_Pos                  _U_(8)                                               /**< (DACC_WPSR) Write Protection Violation Source Position */
#define DACC_WPSR_WPVSRC_Msk                  (_U_(0xFF) << DACC_WPSR_WPVSRC_Pos)                  /**< (DACC_WPSR) Write Protection Violation Source Mask */
#define DACC_WPSR_WPVSRC(value)               (DACC_WPSR_WPVSRC_Msk & ((value) << DACC_WPSR_WPVSRC_Pos))
#define DACC_WPSR_Msk                         _U_(0x0000FF01)                                      /**< (DACC_WPSR) Register Mask  */


/** \brief DACC register offsets definitions */
#define DACC_CR_REG_OFST               (0x00)              /**< (DACC_CR) Control Register Offset */
#define DACC_MR_REG_OFST               (0x04)              /**< (DACC_MR) Mode Register Offset */
#define DACC_TRIGR_REG_OFST            (0x08)              /**< (DACC_TRIGR) Trigger Register Offset */
#define DACC_CHER_REG_OFST             (0x10)              /**< (DACC_CHER) Channel Enable Register Offset */
#define DACC_CHDR_REG_OFST             (0x14)              /**< (DACC_CHDR) Channel Disable Register Offset */
#define DACC_CHSR_REG_OFST             (0x18)              /**< (DACC_CHSR) Channel Status Register Offset */
#define DACC_CDR_REG_OFST              (0x1C)              /**< (DACC_CDR) Conversion Data Register 0 Offset */
#define DACC_IER_REG_OFST              (0x24)              /**< (DACC_IER) Interrupt Enable Register Offset */
#define DACC_IDR_REG_OFST              (0x28)              /**< (DACC_IDR) Interrupt Disable Register Offset */
#define DACC_IMR_REG_OFST              (0x2C)              /**< (DACC_IMR) Interrupt Mask Register Offset */
#define DACC_ISR_REG_OFST              (0x30)              /**< (DACC_ISR) Interrupt Status Register Offset */
#define DACC_ACR_REG_OFST              (0x94)              /**< (DACC_ACR) Analog Current Register Offset */
#define DACC_WPMR_REG_OFST             (0xE4)              /**< (DACC_WPMR) Write Protection Mode Register Offset */
#define DACC_WPSR_REG_OFST             (0xE8)              /**< (DACC_WPSR) Write Protection Status Register Offset */

